# -*- coding: UTF-8 -*-
# @Time : 2019/5/3 9:25 
# @Author : 墨染
# @Site :  
# @File : print.py 
# @Software: PyCharm

# n=input("输入一个整数：")
# print("{:>3}%@{}".format(n,"="*(n//5)))


# s="学而时习之,不亦说乎?有朋自远方来,不亦乐乎?人不知而不愠,不亦君子乎?"
# n = 0 # 汉字个数
# m = 0 # 标点符号个数
# m=s.count(",")+s.count("?")
# n=len(s)-m
# print(len(s))
# print("标点符号的个数是:{},汉字的个数是{}：".format(m,n/3))#一个中文3个字节


#使用程序计算整数 N 到整数 N+100 之间所有奇数的数值和，不包含 N+100，并将结果输出。整数 N 由用户给出，不判断输入异常
# n=input("输入一个正整数:")
# sum=0
# for i in range(n,n+100):
#     if(i%2!=0):
#         sum=sum+i
# print(sum)


#根据输入字符串 s，输出一个宽度为 15 字符，字符串 s 居中显示，以“=”填充的格式。如果输入字符串超过 15 个字符，则输出字符串前 15 个字符。
# s=raw_input("输入一个字符串:\n")
# print("{:=^15}".format(s[0:15]))
#^是居中，后面带宽度.冒号后面是要填充的字符，只能是一个



#根据斐波那契数列的定义，F(0)=0，F(1)=1, F(n)=F(n–1)+F(n–2)(n≥2)，输出不大于 100 的序列元素
a,b = 0, 1
while a<=100:
    print(a,end=',')
    a,b =b,a+b